const cars = [
    {
        "Модель": "Toyota Land Cruiser",
        "Поколение": "J300",
        "Год начала выпуска": 2021,
        "Тип кузова": "Внедорожник",
        "Длина": 4.95,
        "Мощность": 409,
        "Макс. скорость": 210
    },
    {
        "Модель": "Toyota Land Cruiser",
        "Поколение": "J200",
        "Год начала выпуска": 2007,
        "Тип кузова": "Внедорожник",
        "Длина": 4.95,
        "Мощность": 309,
        "Макс. скорость": 200
    },
    {
        "Модель": "BMW 7 Series",
        "Поколение": "G70",
        "Год начала выпуска": 2022,
        "Тип кузова": "Седан",
        "Длина": 5.39,
        "Мощность": 544,
        "Макс. скорость": 250
    },
    {
        "Модель": "BMW 7 Series",
        "Поколение": "G11",
        "Год начала выпуска": 2015,
        "Тип кузова": "Седан",
        "Длина": 5.12,
        "Мощность": 450,
        "Макс. скорость": 250
    },
    {
        "Модель": "Mercedes-Benz S-Class",
        "Поколение": "W223",
        "Год начала выпуска": 2020,
        "Тип кузова": "Седан",
        "Длина": 5.18,
        "Мощность": 503,
        "Макс. скорость": 250
    },
    {
        "Модель": "Mercedes-Benz S-Class",
        "Поколение": "W222",
        "Год начала выпуска": 2013,
        "Тип кузова": "Седан",
        "Длина": 5.12,
        "Мощность": 455,
        "Макс. скорость": 250
    },
    {
        "Модель": "Nissan GT-R",
        "Поколение": "R35 (Premium)",
        "Год начала выпуска": 2017,
        "Тип кузова": "Купе",
        "Длина": 4.71,
        "Мощность": 570,
        "Макс. скорость": 315
    },
    {
        "Модель": "Nissan GT-R",
        "Поколение": "R35",
        "Год начала выпуска": 2007,
        "Тип кузова": "Купе",
        "Длина": 4.65,
        "Мощность": 480,
        "Макс. скорость": 310
    },
    {
        "Модель": "Honda NSX",
        "Поколение": "NC1",
        "Год начала выпуска": 2016,
        "Тип кузова": "Купе",
        "Длина": 4.47,
        "Мощность": 581,
        "Макс. скорость": 308
    },
    {
        "Модель": "Honda NSX",
        "Поколение": "NA1/NA2",
        "Год начала выпуска": 1990,
        "Тип кузова": "Купе",
        "Длина": 4.43,
        "Мощность": 280,
        "Макс. скорость": 270
    },
    {
        "Модель": "Mazda MX-5 Miata",
        "Поколение": "ND",
        "Год начала выпуска": 2015,
        "Тип кузова": "Родстер",
        "Длина": 3.91,
        "Мощность": 184,
        "Макс. скорость": 230
    },
    {
        "Модель": "Mazda MX-5 Miata",
        "Поколение": "NC",
        "Год начала выпуска": 2005,
        "Тип кузова": "Родстер",
        "Длина": 4.02,
        "Мощность": 170,
        "Макс. скорость": 215
    },
    {
        "Модель": "Toyota Supra",
        "Поколение": "A90",
        "Год начала выпуска": 2019,
        "Тип кузова": "Купе",
        "Длина": 4.38,
        "Мощность": 387,
        "Макс. скорость": 250
    },
    {
        "Модель": "Toyota Supra",
        "Поколение": "A80",
        "Год начала выпуска": 1993,
        "Тип кузова": "Купе",
        "Длина": 4.52,
        "Мощность": 280,
        "Макс. скорость": 250
    },
    {
        "Модель": "BMW M5",
        "Поколение": "F90",
        "Год начала выпуска": 2017,
        "Тип кузова": "Седан",
        "Длина": 4.96,
        "Мощность": 600,
        "Макс. скорость": 305
    },
    {
        "Модель": "BMW M5",
        "Поколение": "F10",
        "Год начала выпуска": 2011,
        "Тип кузова": "Седан",
        "Длина": 4.91,
        "Мощность": 560,
        "Макс. скорость": 305
    },
    {
        "Модель": "Mercedes-AMG GT",
        "Поколение": "C190",
        "Год начала выпуска": 2014,
        "Тип кузова": "Купе",
        "Длина": 4.54,
        "Мощность": 585,
        "Макс. скорость": 318
    },
    {
        "Модель": "Mercedes-Benz SL",
        "Поколение": "R231",
        "Год начала выпуска": 2012,
        "Тип кузова": "Родстер",
        "Длина": 4.62,
        "Мощность": 435,
        "Макс. скорость": 250
    },
    {
        "Модель": "Nissan Patrol",
        "Поколение": "Y62",
        "Год начала выпуска": 2010,
        "Тип кузова": "Внедорожник",
        "Длина": 5.16,
        "Мощность": 405,
        "Макс. скорость": 210
    },
    {
        "Модель": "Nissan Patrol",
        "Поколение": "Y61",
        "Год начала выпуска": 1997,
        "Тип кузова": "Внедорожник",
        "Длина": 5.08,
        "Мощность": 170,
        "Макс. скорость": 165
    },
    {
        "Модель": "Honda Civic Type R",
        "Поколение": "FK8",
        "Год начала выпуска": 2017,
        "Тип кузова": "Хэтчбек",
        "Длина": 4.56,
        "Мощность": 320,
        "Макс. скорость": 272
    },
    {
        "Модель": "Honda Civic Type R",
        "Поколение": "FK2",
        "Год начала выпуска": 2015,
        "Тип кузова": "Хэтчбек",
        "Длина": 4.39,
        "Мощность": 310,
        "Макс. скорость": 270
    },
    {
        "Модель": "Mazda RX-7",
        "Поколение": "FD",
        "Год начала выпуска": 1992,
        "Тип кузова": "Купе",
        "Длина": 4.28,
        "Мощность": 280,
        "Макс. скорость": 250
    },
    {
        "Модель": "Mazda RX-7",
        "Поколение": "FC",
        "Год начала выпуска": 1985,
        "Тип кузова": "Купе",
        "Длина": 4.31,
        "Мощность": 205,
        "Макс. скорость": 230
    },
    {
        "Модель": "Toyota Crown",
        "Поколение": "S235",
        "Год начала выпуска": 2022,
        "Тип кузова": "Седан",
        "Длина": 4.93,
        "Мощность": 349,
        "Макс. скорость": 230
    },
    {
        "Модель": "Toyota Crown",
        "Поколение": "S210",
        "Год начала выпуска": 2018,
        "Тип кузова": "Седан",
        "Длина": 4.91,
        "Мощность": 299,
        "Макс. скорость": 225
    },
    {
        "Модель": "BMW X5",
        "Поколение": "G05",
        "Год начала выпуска": 2018,
        "Тип кузова": "Внедорожник",
        "Длина": 4.92,
        "Мощность": 530,
        "Макс. скорость": 250
    },
    {
        "Модель": "BMW X5",
        "Поколение": "F15",
        "Год начала выпуска": 2013,
        "Тип кузова": "Внедорожник",
        "Длина": 4.88,
        "Мощность": 450,
        "Макс. скорость": 250
    },
    {
        "Модель": "Mercedes-Benz G-Class",
        "Поколение": "W463",
        "Год начала выпуска": 2018,
        "Тип кузова": "Внедорожник",
        "Длина": 4.87,
        "Мощность": 585,
        "Макс. скорость": 240
    },
    {
        "Модель": "Mercedes-Benz G-Class",
        "Поколение": "W463 (pre-facelift)",
        "Год начала выпуска": 1990,
        "Тип кузова": "Внедорожник",
        "Длина": 4.66,
        "Мощность": 296,
        "Макс. скорость": 180
    },
    {
        "Модель": "Nissan Z",
        "Поколение": "Z34",
        "Год начала выпуска": 2022,
        "Тип кузова": "Купе",
        "Длина": 4.38,
        "Мощность": 405,
        "Макс. скорость": 250
    },
    {
        "Модель": "Nissan 370Z",
        "Поколение": "Z34",
        "Год начала выпуска": 2008,
        "Тип кузова": "Купе",
        "Длина": 4.25,
        "Мощность": 332,
        "Макс. скорость": 250
    },
    {
        "Модель": "Honda Accord",
        "Поколение": "XI",
        "Год начала выпуска": 2017,
        "Тип кузова": "Седан",
        "Длина": 4.88,
        "Мощность": 252,
        "Макс. скорость": 240
    },
    {
        "Модель": "Honda Accord",
        "Поколение": "IX",
        "Год начала выпуска": 2012,
        "Тип кузова": "Седан",
        "Длина": 4.86,
        "Мощность": 190,
        "Макс. скорость": 230
    },
    {
        "Модель": "Mazda 6",
        "Поколение": "GJ/GL",
        "Год начала выпуска": 2012,
        "Тип кузова": "Седан",
        "Длина": 4.87,
        "Мощность": 250,
        "Макс. скорость": 230
    },
    {
        "Модель": "Mazda 6",
        "Поколение": "GG/GY",
        "Год начала выпуска": 2007,
        "Тип кузова": "Седан",
        "Длина": 4.75,
        "Мощность": 170,
        "Макс. скорость": 215
    },
    {
        "Модель": "Toyota Camry",
        "Поколение": "XV70",
        "Год начала выпуска": 2017,
        "Тип кузова": "Седан",
        "Длина": 4.88,
        "Мощность": 301,
        "Макс. скорость": 230
    },
    {
        "Модель": "Toyota Camry",
        "Поколение": "XV50",
        "Год начала выпуска": 2011,
        "Тип кузова": "Седан",
        "Длина": 4.85,
        "Мощность": 178,
        "Макс. скорость": 210
    },
    {
        "Модель": "BMW 3 Series",
        "Поколение": "G20",
        "Год начала выпуска": 2018,
        "Тип кузова": "Седан",
        "Длина": 4.71,
        "Мощность": 374,
        "Макс. скорость": 250
    },
    {
        "Модель": "BMW 3 Series",
        "Поколение": "F30",
        "Год начала выпуска": 2011,
        "Тип кузова": "Седан",
        "Длина": 4.63,
        "Мощность": 306,
        "Макс. скорость": 250
    },
    {
        "Модель": "Mercedes-Benz C-Class",
        "Поколение": "W206",
        "Год начала выпуска": 2021,
        "Тип кузова": "Седан",
        "Длина": 4.75,
        "Мощность": 258,
        "Макс. скорость": 250
    },
    {
        "Модель": "Mercedes-Benz C-Class",
        "Поколение": "W205",
        "Год начала выпуска": 2014,
        "Тип кузова": "Седан",
        "Длина": 4.68,
        "Мощность": 245,
        "Макс. скорость": 250
    },
    {
        "Модель": "Nissan Skyline GT-R",
        "Поколение": "R34",
        "Год начала выпуска": 1999,
        "Тип кузова": "Купе",
        "Длина": 4.60,
        "Мощность": 280,
        "Макс. скорость": 250
    },
    {
        "Модель": "Nissan Skyline GT-R",
        "Поколение": "R33",
        "Год начала выпуска": 1995,
        "Тип кузова": "Купе",
        "Длина": 4.67,
        "Мощность": 280,
        "Макс. скорость": 250
    },
    {
        "Модель": "Honda S2000",
        "Поколение": "AP2",
        "Год начала выпуска": 2004,
        "Тип кузова": "Родстер",
        "Длина": 4.13,
        "Мощность": 240,
        "Макс. скорость": 240
    },
    {
        "Модель": "Honda S2000",
        "Поколение": "AP1",
        "Год начала выпуска": 1999,
        "Тип кузова": "Родстер",
        "Длина": 4.13,
        "Мощность": 240,
        "Макс. скорость": 240
    },
    {
        "Модель": "Mazda CX-5",
        "Поколение": "KF",
        "Год начала выпуска": 2017,
        "Тип кузова": "Кроссовер",
        "Длина": 4.55,
        "Мощность": 194,
        "Макс. скорость": 195
    },
    {
        "Модель": "Mazda CX-5",
        "Поколение": "KE",
        "Год начала выпуска": 2012,
        "Тип кузова": "Кроссовер",
        "Длина": 4.54,
        "Мощность": 165,
        "Макс. скорость": 190
    },
    {
        "Модель": "Toyota Hilux",
        "Поколение": "VIII",
        "Год начала выпуска": 2015,
        "Тип кузова": "Пикап",
        "Длина": 5.33,
        "Мощность": 204,
        "Макс. скорость": 180
    },
    {
        "Модель": "Toyota Hilux",
        "Поколение": "VII",
        "Год начала выпуска": 2005,
        "Тип кузова": "Пикап",
        "Длина": 5.26,
        "Мощность": 171,
        "Макс. скорость": 170
    },
    {
        "Модель": "BMW Z4",
        "Поколение": "G29",
        "Год начала выпуска": 2018,
        "Тип кузова": "Родстер",
        "Длина": 4.32,
        "Мощность": 340,
        "Макс. скорость": 250
    },
    {
        "Модель": "BMW Z4",
        "Поколение": "E89",
        "Год начала выпуска": 2009,
        "Тип кузова": "Родстер",
        "Длина": 4.24,
        "Мощность": 306,
        "Макс. скорость": 250
    },
    {
        "Модель": "Mercedes-Benz E-Class",
        "Поколение": "W213",
        "Год начала выпуска": 2016,
        "Тип кузова": "Седан",
        "Длина": 4.93,
        "Мощность": 333,
        "Макс. скорость": 250
    },
    {
        "Модель": "Mercedes-Benz E-Class",
        "Поколение": "W212",
        "Год начала выпуска": 2009,
        "Тип кузова": "Седан",
        "Длина": 4.87,
        "Мощность": 292,
        "Макс. скорость": 250
    }
];